package com.tms;

public class LessonHWArray {
    /* Задание 13. Создать последовательность случайных чисел, найти и вывести наибольшее из них  */



    /* Задание 14. Создать массив оценок произвольной длины, вывести максимальную и
       минимальную оценку, её (их) номера.   */



    /* Задание 15. Создать массив, заполнить его случайными элементами, распечатать,
    перевернуть, и снова распечатать (при переворачивании нежелательно создавать
    еще один массив).  */



    /* Задание 16. Определите сумму элементов одномерного массива, расположенных между
    минимальным и максимальным значениями.  */



    /* Задание 17. Создать двухмерный квадратный массив, и заполнить его «бабочкой», т.е
    таким образом: */



}
